nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitSWD_DEBUGPins(void)
{

    const uint32_t port2_pin24_config = (/* Pin is configured as SWO */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN24 (coords: N3) is configured as SWO */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 24U, port2_pin24_config);

    const uint32_t port2_pin25_config = (/* Pin is configured as SWCLK */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN25 (coords: M2) is configured as SWCLK */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 25U, port2_pin25_config);

    const uint32_t port2_pin26_config = (/* Pin is configured as SWDIO */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN26 (coords: M4) is configured as SWDIO */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 26U, port2_pin26_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPSRAMPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: FLEXSPI1, signal: FLEXSPI_SCLK, pin_signal: PIO4_11/FC2_SCK/FLEXSPI1_SCLK/SD1_CLK, ibena: enabled, drive: full}
  - {pin_num: G2, peripheral: FLEXSPI1, signal: FLEXSPI_DATA1, pin_signal: PIO4_13/FC2_RXD_SDA_MOSI_DATA/FLEXSPI1_DATA1/SD1_D0, ibena: enabled, drive: full}
  - {pin_num: H1, peripheral: FLEXSPI1, signal: FLEXSPI_DATA0, pin_signal: PIO4_12/FC2_TXD_SCL_MISO_WS/FLEXSPI1_DATA0/SD1_CMD, ibena: enabled, drive: full}
  - {pin_num: F1, peripheral: FLEXSPI1, signal: FLEXSPI_DATA2, pin_signal: PIO4_14/FC2_CTS_SDA_SSEL0/FLEXSPI1_DATA2/SD1_D1, ibena: enabled, drive: full}
  - {pin_num: K3, peripheral: FLEXSPI1, signal: FLEXSPI_DATA3, pin_signal: PIO4_15/FC2_RTS_SCL_SSEL1/FLEXSPI1_DATA3/SD1_D2, ibena: enabled, drive: full}
  - {pin_num: H3, peripheral: FLEXSPI1, signal: FLEXSPI_DQS, pin_signal: PIO4_16/FC2_SSEL2/FLEXSPI1_DQS/SD1_D3, pupdena: enabled, pupdsel: pullDown, ibena: enabled,
    drive: full}
  - {pin_num: E13, peripheral: FLEXSPI1, signal: FLEXSPI_SS0_N, pin_signal: PIO4_18/FLEXSPI1_SS0_N/SD1_D4/ADC0_6, ibena: enabled, drive: full}
  - {pin_num: H5, peripheral: FLEXSPI1, signal: FLEXSPI_DATA4, pin_signal: PIO5_15/LCD_D20/FLEXSPI1_DATA4/FC4_CTS_SDA_SSEL0, ibena: enabled, drive: full}
  - {pin_num: H4, peripheral: FLEXSPI1, signal: FLEXSPI_DATA5, pin_signal: PIO5_16/LCD_D21/FLEXSPI1_DATA5/FC4_RTS_SCL_SSEL1, ibena: enabled, drive: full}
  - {pin_num: J3, peripheral: FLEXSPI1, signal: FLEXSPI_DATA6, pin_signal: PIO5_17/LCD_D22/FLEXSPI1_DATA6/FC4_SSEL2, ibena: enabled, drive: full}
  - {pin_num: J4, peripheral: FLEXSPI1, signal: FLEXSPI_DATA7, pin_signal: PIO5_18/LCD_D23/FLEXSPI1_DATA7/FC4_SSEL3, ibena: enabled, drive: full}
  - {pin_num: A12, peripheral: GPIO, signal: 'PIO0, 28', pin_signal: PIO0_28/FC4_SCK/CTIMER4_MAT0/I2S_BRIDGE_CLK_OUT/SEC_PIO0_28, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

