nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.c
    const uint32_t port0_pin29_config = (/* Pin is configured as FC4_TXD_SCL_MISO_WS */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN29 (coords: B11) is configured as FC4_TXD_SCL_MISO_WS */
    IOPCTL_PinMuxSet(IOPCTL, 0U, 29U, port0_pin29_config);

    const uint32_t port0_pin30_config = (/* Pin is configured as FC4_RXD_SDA_MOSI_DATA */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN30 (coords: D14) is configured as FC4_RXD_SDA_MOSI_DATA */
    IOPCTL_PinMuxSet(IOPCTL, 0U, 30U, port0_pin30_config);

    const uint32_t ACC_RESET = (/* Pin is configured as PIO1_7 */
                                IOPCTL_PIO_FUNC0 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Disable input buffer function */
                                IOPCTL_PIO_INBUF_DI |
                                /* Normal mode */
                                IOPCTL_PIO_SLEW_RATE_NORMAL |
                                /* Normal drive */
                                IOPCTL_PIO_FULLDRIVE_DI |
                                /* Analog mux is disabled */
                                IOPCTL_PIO_ANAMUX_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI);
    /* PORT1 PIN7 (coords: M1) is configured as PIO1_7 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_ACC_RESET_PORT, BOARD_ACC_RESET_PIN, ACC_RESET);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMIPI_DSIPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: GPIO, signal: 'PIO3, 21', pin_signal: PIO3_21/SD1_VOLT/LCD_D22/CTIMER4_MAT3/GPIO_INT_BMAT, direction: OUTPUT, ibena: enabled}
  - {pin_num: E10, peripheral: GPIO, signal: 'PIO3, 15', pin_signal: PIO3_15/SD1_D4/LCD_D16/CTIMER3_MAT1/FC5_SCK, direction: OUTPUT, ibena: enabled}
  - {pin_num: E14, peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12/FC1_SSEL2/SCT0_GPI2/SCT0_OUT2/CTIMER_INP3/SEC_PIO0_12/ADC0_1, direction: OUTPUT}
  - {pin_num: D1, peripheral: MIPI_DSI_HOST, signal: CLKN, pin_signal: MIPI_DSI_CLKN}
  - {pin_num: D2, peripheral: MIPI_DSI_HOST, signal: CLKP, pin_signal: MIPI_DSI_CLKP}
  - {pin_num: C2, peripheral: MIPI_DSI_HOST, signal: 'DN, 0', pin_signal: MIPI_DSI_D0N}
  - {pin_num: F3, peripheral: MIPI_DSI_HOST, signal: 'DN, 1', pin_signal: MIPI_DSI_D1N}
  - {pin_num: B1, peripheral: MIPI_DSI_HOST, signal: 'DP, 0', pin_signal: MIPI_DSI_D0P}
  - {pin_num: E3, peripheral: MIPI_DSI_HOST, signal: 'DP, 1', pin_signal: MIPI_DSI_D1P}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMIPI_DSIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitMIPI_DSIPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_HsGpio0);

    /* Enables the clock for the GPIO3 module */
    CLOCK_EnableClock(kCLOCK_HsGpio3);

    gpio_pin_config_t LCM_BL_PWM_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin E14)  */
    GPIO_PinInit(BOARD_LCM_BL_PWM_GPIO, BOARD_LCM_BL_PWM_PORT, BOARD_LCM_BL_PWM_PIN, &LCM_BL_PWM_config);

    gpio_pin_config_t LCM_PWR_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin E10)  */
    GPIO_PinInit(BOARD_LCM_PWR_EN_GPIO, BOARD_LCM_PWR_EN_PORT, BOARD_LCM_PWR_EN_PIN, &LCM_PWR_EN_config);

    gpio_pin_config_t LCM_RESET_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin E5)  */
    GPIO_PinInit(BOARD_LCM_RESET_B_GPIO, BOARD_LCM_RESET_B_PORT, BOARD_LCM_RESET_B_PIN, &LCM_RESET_B_config);

